Extensions installed on Codespaces: shiny adventure:
afractal.node-essentials@1.1.0
ainity.smartaicoder@0.0.8
anthropic.claude-code@2.0.25
austenc.tailwind-docs@2.1.0
be5invis.vscode-icontheme-nomo-dark@1.3.7
bhshawon.node-json-autocomplete@0.1.3
bierner.markdown-preview-github-styles@2.2.0
bradlc.vscode-tailwindcss@0.14.29
charliermarsh.ruff@2025.28.0
christian-kohler.npm-intellisense@1.4.5
christian-kohler.path-intellisense@2.10.0
codacy-app.codacy@1.11.5
csstools.postcss@1.0.9
cweijan.chat-copilot@5.0.1
dadroit.dadroit-json-generator@1.2.2
davidanson.vscode-markdownlint@0.60.0
dbaeumer.vscode-eslint@3.0.16
donjayamanne.githistory@0.6.20
eamodio.gitlens@17.6.2
ecmel.vscode-html-css@2.0.13
editorconfig.editorconfig@0.17.4
esbenp.prettier-vscode@11.0.0
feiskyer.chatgpt-copilot@4.10.0
formulahendry.auto-close-tag@0.5.15
formulahendry.auto-rename-tag@0.1.10
foxundermoon.shell-format@7.2.8
funkyremi.vscode-google-translate@1.5.0
github.codespaces@1.17.5
github.copilot@1.387.0
github.copilot-chat@0.32.3
github.github-vscode-theme@6.3.5
github.remotehub@0.64.0
github.vscode-github-actions@0.28.0
github.vscode-pull-request-github@0.120.1
hex-ci.stylelint-plus@0.57.0
humao.rest-client@0.25.1
intelligentcomputing.smart-vscode@1.0.6
kodu-ai.claude-dev-experimental@2.3.13
matthiesen-technology.yaml-with-script@1.1.2
metabob.metabob@1.4.0
mikestead.dotenv@1.0.1
ms-azure-load-testing.microsoft-testing@0.1.17
ms-azuretools.azure-dev@0.10.0
ms-azuretools.vscode-azure-github-copilot@1.0.129
ms-azuretools.vscode-azure-mcp-server@0.9.7
ms-azuretools.vscode-azureappservice@0.26.4
ms-azuretools.vscode-azurecontainerapps@0.9.1
ms-azuretools.vscode-azurefunctions@1.19.2
ms-azuretools.vscode-azureresourcegroups@0.11.5
ms-azuretools.vscode-azurestaticwebapps@0.13.2
ms-azuretools.vscode-azurestorage@0.17.1
ms-azuretools.vscode-azurevirtualmachines@0.6.10
ms-azuretools.vscode-bicep@0.38.33
ms-azuretools.vscode-containers@2.2.0
ms-azuretools.vscode-cosmosdb@0.28.2
ms-dotnettools.vscode-dotnet-runtime@2.3.7
ms-kubernetes-tools.vscode-kubernetes-tools@1.3.26
ms-playwright.playwright@1.1.16
ms-python.debugpy@2025.14.1
ms-python.python@2025.16.0
ms-python.vscode-pylance@2025.8.3
ms-python.vscode-python-envs@1.10.0
ms-toolsai.jupyter@2025.9.1
ms-toolsai.jupyter-keymap@1.1.2
ms-toolsai.jupyter-renderers@1.3.0
ms-toolsai.vscode-jupyter-cell-tags@0.1.9
ms-toolsai.vscode-jupyter-slideshow@0.1.6
ms-vscode.azure-repos@0.40.0
ms-vscode.azurecli@0.6.0
ms-vscode.cmake-tools@1.21.36
ms-vscode.cpptools@1.28.3
ms-vscode.live-server@0.4.16
ms-vscode.powershell@2025.4.0
ms-vscode.remote-repositories@0.42.0
ms-vscode.vscode-node-azure-pack@1.7.0
ms-vsliveshare.vsliveshare@1.0.5959
ms-windows-ai-studio.windows-ai-studio@0.24.0
naumovs.color-highlight@2.8.0
openai.chatgpt@0.4.21
oracle.oracle-java@24.1.2
orta.vscode-jest@6.4.4
redhat.fabric8-analytics@0.10.1
redhat.java@1.46.0
redhat.vscode-yaml@1.19.1
ritwickdey.liveserver@5.7.9
rvest.vs-code-prettier-eslint@6.0.0
shahilkumar.docxreader@1.2.2
shd101wyy.markdown-preview-enhanced@0.8.19
stivo.tailwind-fold@0.2.0
streetsidesoftware.code-spell-checker@4.2.6
streetsidesoftware.code-spell-checker-cspell-bundled-dictionaries@2.0.11
streetsidesoftware.code-spell-checker-medical-terms@3.0.4
stylelint.vscode-stylelint@1.5.3
teamsdevapp.vscode-ai-foundry@0.10.6
timheuer.jsondbg@0.2.3
timonwong.shellcheck@0.38.3
usernamehw.errorlens@3.26.0
visualstudioexptteam.intellicode-api-usage-examples@0.2.9
visualstudioexptteam.vscodeintellicode@1.3.2
vscjava.vscode-gradle@3.17.0
vscjava.vscode-java-debug@0.58.2
vscjava.vscode-java-dependency@0.26.1
vscjava.vscode-java-pack@0.30.3
vscjava.vscode-java-test@0.43.1
vscjava.vscode-maven@0.44.0
wallabyjs.quokka-vscode@1.0.742
wix.vscode-import-cost@3.3.0
yandeu.five-server@0.3.9
yoavbls.pretty-ts-errors@0.6.1
zignd.html-css-class-completion@1.20.0
